export const TABLET_RESOLUTION = 700;

export const sliderConfig = {
  WRAPPER_SELECTOR: '.slider',
  ITEMS_SELECTOR: '.slider__list',
  ITEM_SELECTOR: '.slider__list-item',
  SELECTOR_INDICATOR: '.slider__indicators>li',
  SLIDER_TRANSITION_OFF: 'slider_transition_diasbled',
  CLASS_INDICATOR_ACTIVE: 'active',
};

export const coordinates = [
  { name: 'Москве', coords: [55.87588362381393, 37.79852989200479] },
  { name: 'Санкт-Петербурге', coords: [59.32067450825698, 30.192569499999982] },
  { name: 'Уфе', coords: [54.71451099999512, 56.598630000000006] },
  { name: 'Перми', coords: [58.02283760827209, 56.22942499999996] },
  { name: 'Самаре', coords: [53.2052169863642, 50.09496412988278] },
  { name: 'Екатеринбурге', coords: [56.85032829010864, 60.59464881460184] },
  { name: 'Воронеже', coords: [51.68795174131643, 39.20587504394522] },
  { name: 'Волгограде', coords: [48.727768555239905, 44.51142000878902] },
  { name: 'Ростов-на-Дону', coords: [47.23774265878375, 39.71773523876951] },
  { name: 'Краснодаре', coords: [45.04786481566433, 38.9743498491211] },
  { name: 'Нижнем Новгороде', coords: [56.33498023929342, 44.009309249999994] },
  { name: 'Пензе', coords: [53.20579765495674, 45.01897834912104] },
  { name: 'Казани', coords: [55.810250508217464, 49.104788518554635] },
  { name: 'Ижевске', coords: [56.86477227796696, 53.206019309570266] },
  { name: 'Тюмени', coords: [57.16316105272456, 65.54319191796871] },
  { name: 'Челябинске', coords: [55.174795031826626, 61.40147012988272] },
  { name: 'Новосибирске', coords: [55.04383673211038, 82.919651288085844] },
  { name: 'Томске', coords: [56.499094515101575, 84.947911415039] },
  { name: 'Сургуте', coords: [61.24720789650156, 73.3930313066405] },
  { name: ' Нижневартовске', coords: [60.94448095748384, 76.55163661035152] },
  { name: 'Красноярске', coords: [56.01771335613386, 92.8528859892578] },
  { name: 'Иркутске', coords: [52.2966976435338, 104.28097120117178] },
];

export const textSnippets = [
  'Будь первым в',
  'Открыть барбершоп в',
  'Стать владельцем барбершопа в',
  'Купить франшизу в',
  'Подать заявку на открытие в',
];
